
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.shared_access_key[&#34;hmc-servicebus-connection-string&#34;]
  * azurerm_key_vault_secret.shared_access_key[&#34;hmc-servicebus-shared-access-key&#34;]
  * azurerm_servicebus_subscription_rule.topic_filter_rule_sscs
  * module.servicebus_subscription.azurerm_servicebus_subscription.servicebus_subscription
* Delete
  * azurerm_key_vault_secret.hmc-servicebus-connection-string
  * azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc-servicebus-connection-string will be destroyed
  # (because azurerm_key_vault_secret.hmc-servicebus-connection-string is not in configuration)
  - resource "azurerm_key_vault_secret" "hmc-servicebus-connection-string" {
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/9fe13c80046746c79aa33ff5eb3555cc" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-connection-string" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "9fe13c80046746c79aa33ff5eb3555cc" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-connection-string" -> null
    }

  # azurerm_key_vault_secret.shared_access_key["hmc-servicebus-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "shared_access_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "hmc-servicebus-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.shared_access_key["hmc-servicebus-shared-access-key"] will be created
  + resource "azurerm_key_vault_secret" "shared_access_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "hmc-servicebus-shared-access-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key will be destroyed
  # (because azurerm_key_vault_secret.sscs-hmc-servicebus-hared-access-key is not in configuration)
  - resource "azurerm_key_vault_secret" "sscs-hmc-servicebus-hared-access-key" {
      - id             = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/f3327b3a85e448598e2d02530aacd51b" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat" -> null
      - name           = "hmc-servicebus-shared-access-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "f3327b3a85e448598e2d02530aacd51b" -> null
      - versionless_id = "https://sscs-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key" -> null
    }

  # azurerm_servicebus_subscription_rule.topic_filter_rule_sscs will be created
  + resource "azurerm_servicebus_subscription_rule" "topic_filter_rule_sscs" {
      + filter_type     = "CorrelationFilter"
      + id              = (known after apply)
      + name            = "hmc-servicebus-aat-subscription-rule-bba3"
      + subscription_id = (known after apply)

      + correlation_filter {
          + properties = {
              + "hmctsServiceId" = "BBA3"
            }
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be destroyed
  # (because azurerm_servicebus_subscription.servicebus_subscription is not in configuration)
  - resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      - auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S" -> null
      - dead_lettering_on_filter_evaluation_error = true -> null
      - dead_lettering_on_message_expiration      = true -> null
      - default_message_ttl                       = "P10675199DT2H48M5.4775807S" -> null
      - enable_batched_operations                 = false -> null
      - id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-to-sscs-subscription-aat" -> null
      - lock_duration                             = "PT1M" -> null
      - max_delivery_count                        = 10 -> null
      - name                                      = "hmc-to-sscs-subscription-aat" -> null
      - requires_session                          = false -> null
      - status                                    = "Active" -> null
      - topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> null
    }

  # module.servicebus_subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-to-sscs-subscription-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":356,"Program":"tfcmt","SHA1":"","Vars":{}} -->